src_ext/InformationRegisters/УЗ_НастройкиКаналов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_НастройкиКаналов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Включен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ПровайдерыСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяБота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СмещениеОбновлений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПропускЗаЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_КаналыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_КлючиКаналов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_КлючиКаналов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_КаналыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Enums/УЗ_ПровайдерыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_ПровайдерыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>TelegramBotAPI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMSRU</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMSC</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenAPI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wazzup</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Enums/УЗ_КаналыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>УЗ_КаналыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телеграм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WhatsApp</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/CommonModules/УЗ_ПровайдерыСообщений/Ext/Module.bsl
//Провайдеры сообщений по HTTP: Telegram Bot API, SMS.ru, SMSC.ru, Green-API и Wazzup (WhatsApp) — по их публичной
//документации (сентябрь 2026). Без подсистем хозяина: HTTPСоединение платформы с таймаутом.
//Наружу запрос уходит только из функции ВыполнитьHTTP (аудит внешний_мир держит это правило): в песочнице сеанса
//(УЗ_Почта.ПесочницаВключена — тесты на копиях баз) запрос к любому адресу, кроме этой машины (127.0.0.1,
//localhost — заглушка сервисов в тестах), не отправляется, а пишется в журнал регистрации.
//Ключи доступа (токен бота, api_id, пароль, apiToken) читаются только здесь, в привилегированном режиме, и ни в
//журнал регистрации, ни в текст ошибки не попадают: адрес запроса в журнал пишется без пути (в пути Telegram и
//Green-API — ключ), а ключ в тексте ошибки заменяется звёздочками.
//Каждая отправка возвращает, недоступен ли сервис (нет связи, неверный ключ, нет денег на счёте) — тогда
//остальные сообщения этим каналом в этом цикле не отправляются (УЗ_Сообщения), — или отказал только получатель
//(нет такого номера, человек заблокировал бота).

#Область ПрограммныйИнтерфейс

//Адрес сервиса провайдера по умолчанию (боевой). В настройке канала его можно заменить — например, на заглушку
//в тестах или на выделенный адрес Green-API.
Функция АдресПоУмолчанию(Провайдер) Экспорт

	Если Провайдер = Перечисления.УЗ_ПровайдерыСообщений.TelegramBotAPI Тогда
		Возврат "https://api.telegram.org";
	ИначеЕсли Провайдер = Перечисления.УЗ_ПровайдерыСообщений.SMSRU Тогда
		Возврат "https://sms.ru";
	ИначеЕсли Провайдер = Перечисления.УЗ_ПровайдерыСообщений.SMSC Тогда
		Возврат "https://smsc.ru";
	ИначеЕсли Провайдер = Перечисления.УЗ_ПровайдерыСообщений.GreenAPI Тогда
		Возврат "https://api.green-api.com";
	ИначеЕсли Провайдер = Перечисления.УЗ_ПровайдерыСообщений.Wazzup Тогда
		Возврат "https://api.wazzup24.com";
	КонецЕсли;
	Возврат "";

КонецФункции

//Провайдеры, которые умеет канал (для списка выбора в настройках). Массив значений перечисления.
Функция ПровайдерыКанала(Канал) Экспорт

	Итог = Новый Массив;
	Если Канал = Перечисления.УЗ_КаналыСообщений.Телеграм Тогда
		Итог.Добавить(Перечисления.УЗ_ПровайдерыСообщений.TelegramBotAPI);
	ИначеЕсли Канал = Перечисления.УЗ_КаналыСообщений.SMS Тогда
		Итог.Добавить(Перечисления.УЗ_ПровайдерыСообщений.SMSRU);
		Итог.Добавить(Перечисления.УЗ_ПровайдерыСообщений.SMSC);
	ИначеЕсли Канал = Перечисления.УЗ_КаналыСообщений.WhatsApp Тогда
		Итог.Добавить(Перечисления.УЗ_ПровайдерыСообщений.GreenAPI);
		Итог.Добавить(Перечисления.УЗ_ПровайдерыСообщений.Wazzup);
	КонецЕсли;
	Возврат Итог;

КонецФункции

//Нужен ли провайдеру логин (номер аккаунта): SMSC.ru — логин, Green-API — idInstance, Wazzup — channelId.
Функция НуженЛогин(Провайдер) Экспорт

	Возврат Провайдер = Перечисления.УЗ_ПровайдерыСообщений.SMSC
		Или Провайдер = Перечисления.УЗ_ПровайдерыСообщений.GreenAPI
		Или Провайдер = Перечисления.УЗ_ПровайдерыСообщений.Wazzup;

КонецФункции

//Отправить текст одному получателю каналом Telegram, SMS или WhatsApp.
//  Адрес — номер чата Telegram или телефон из 11 цифр (79001234567).
//Структура: Отправлено (Булево), Песочница (задержано песочницей — наружу не ушло), СервисНедоступен (остальным
//в этом цикле не слать), ТекстОшибки.
//  Клавиатура — только Telegram: reply_markup сообщения (Структура: keyboard — кнопки бота, или remove_keyboard);
//  Неопределено — без клавиатуры.
Функция Отправить(Канал, Адрес, Текст, Клавиатура = Неопределено) Экспорт

	Итог = НовыйИтог();
	Параметры = ПараметрыКанала(Канал, Итог.ТекстОшибки);
	Если Параметры = Неопределено Тогда
		Итог.СервисНедоступен = Истина;
		Возврат Итог;
	КонецЕсли;
	Провайдер = Параметры.Провайдер;
	Если Провайдер = Перечисления.УЗ_ПровайдерыСообщений.TelegramBotAPI Тогда
		ОтправитьТелеграм(Параметры, Адрес, Текст, Итог, Клавиатура);
	ИначеЕсли Провайдер = Перечисления.УЗ_ПровайдерыСообщений.SMSRU Тогда
		ОтправитьSMSRU(Параметры, Адрес, Текст, Итог);
	ИначеЕсли Провайдер = Перечисления.УЗ_ПровайдерыСообщений.SMSC Тогда
		ОтправитьSMSC(Параметры, Адрес, Текст, Итог);
	ИначеЕсли Провайдер = Перечисления.УЗ_ПровайдерыСообщений.GreenAPI Тогда
		ОтправитьGreenAPI(Параметры, Адрес, Текст, Итог);
	ИначеЕсли Провайдер = Перечисления.УЗ_ПровайдерыСообщений.Wazzup Тогда
		ОтправитьWazzup(Параметры, Адрес, Текст, Итог);
	Иначе
		Итог.ТекстОшибки = СтрШаблон(НСтр("ru = 'У канала «%1» не выбран провайдер.'"), Канал);
		Итог.СервисНедоступен = Истина;
	КонецЕсли;
	Возврат Итог;

КонецФункции

//Новые сообщения боту Telegram (getUpdates) после обновления с номером Смещение: сообщения и нажатия inline-кнопок.
//Структура: Успех, ТекстОшибки, Песочница, Обновления — Массив структур НомерОбновления, Чат (строка), Текст, Имя,
//  ИдНажатия (у нажатия кнопки — id для answerCallbackQuery, иначе ""), Данные (callback_data нажатой кнопки).
Функция ОбновленияТелеграм(Смещение) Экспорт

	Итог = Новый Структура("Успех, ТекстОшибки, Песочница, Обновления", Ложь, "", Ложь, Новый Массив);
	Параметры = ПараметрыКанала(Перечисления.УЗ_КаналыСообщений.Телеграм, Итог.ТекстОшибки);
	Если Параметры = Неопределено Тогда
		Возврат Итог;
	КонецЕсли;
	Путь = СтрШаблон("/bot%1/getUpdates?timeout=0&allowed_updates=%2&offset=%3", Параметры.Ключ,
		КодироватьСтроку("[""message"",""callback_query""]", СпособКодированияСтроки.КодировкаURL),
			Формат(Смещение + 1, "ЧГ=0; ЧН=0"));
	Ответ = ВыполнитьHTTP(Параметры, "GET", Путь, Неопределено, "", НСтр("ru = 'Telegram: новые сообщения боту'"));
	Если Ответ.Песочница Тогда
		Итог.Песочница = Истина;
		Итог.Успех = Истина;
		Возврат Итог;
	КонецЕсли;
	Данные = ПрочитатьОтвет(Ответ);
	Если Не ПустаяСтрока(Ответ.Ошибка) Или Данные = Неопределено Или Данные.Получить("ok") <> Истина Тогда
		Итог.ТекстОшибки = ТекстОшибкиОтвета(Ответ, Данные, "description");
		Возврат Итог;
	КонецЕсли;
	Результат = Данные.Получить("result");
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Для Каждого Обновление Из Результат Цикл
			Запись = Новый Структура("НомерОбновления, Чат, Текст, Имя, ИдНажатия, Данные",
				Обновление.Получить("update_id"), "", "", "", "", "");
			Нажатие = Обновление.Получить("callback_query");
			Если ТипЗнч(Нажатие) = Тип("Соответствие") Тогда
				Запись.ИдНажатия = Строка(?(Нажатие.Получить("id") = Неопределено, "", Нажатие.Получить("id")));
				Запись.Данные = Строка(?(Нажатие.Получить("data") = Неопределено, "", Нажатие.Получить("data")));
				РазобратьСообщение(Запись, Нажатие.Получить("message"), Нажатие.Получить("from"), Ложь);
			Иначе
				Сообщение = Обновление.Получить("message");
				РазобратьСообщение(Запись, Сообщение,
					?(ТипЗнч(Сообщение) = Тип("Соответствие"), Сообщение.Получить("from"), Неопределено), Истина);
			КонецЕсли;
			Итог.Обновления.Добавить(Запись);
		КонецЦикла;
	КонецЕсли;
	Итог.Успех = Истина;
	Возврат Итог;

КонецФункции

//Ответ Telegram на нажатие inline-кнопки (answerCallbackQuery): без него у кнопки в клиенте крутятся «часики».
//Текст — короткая всплывающая подсказка (до 200 знаков). Структура — как у Отправить.
Функция ОтветитьНаНажатие(ИдНажатия, Текст) Экспорт

	Итог = НовыйИтог();
	Параметры = ПараметрыКанала(Перечисления.УЗ_КаналыСообщений.Телеграм, Итог.ТекстОшибки);
	Если Параметры = Неопределено Тогда
		Итог.СервисНедоступен = Истина;
		Возврат Итог;
	КонецЕсли;
	Тело = Новый Структура("callback_query_id, text", ИдНажатия, Лев(Текст, 200));
	Ответ = ВыполнитьHTTP(Параметры, "POST", "/bot" + Параметры.Ключ + "/answerCallbackQuery", ЗаголовкиJSON(),
		ЗаписатьВJSON(Тело), НСтр("ru = 'Telegram: ответ на нажатие кнопки'"));
	Данные = ПрочитатьОтвет(Ответ);
	Если РазобратьПесочницуИСвязь(Ответ, Итог) Тогда
		Возврат Итог;
	КонецЕсли;
	Если Ответ.КодСостояния = 200 И Данные <> Неопределено И Данные.Получить("ok") = Истина Тогда
		Итог.Отправлено = Истина;
		Возврат Итог;
	КонецЕсли;
	Итог.ТекстОшибки = "Telegram: " + ТекстОшибкиОтвета(Ответ, Данные, "description");
	Итог.СервисНедоступен = Не (Ответ.КодСостояния = 400 Или Ответ.КодСостояния = 403);
	Возврат Итог;

КонецФункции

//Разрешены ли HTTP-запросы коду расширения. Расширение, загруженное из файла, по умолчанию работает в безопасном
//режиме, а в нём HTTP запрещён. Проверяем подключением к закрытому порту этой же машины: запрос никуда не уходит,
//по тексту ошибки видно, кто отказал.
//  ВБезопасномРежиме — проверить из кода с включённым безопасным режимом (тест: так платформа отвечает покупателю,
//  у которого флажок «Безопасный режим» не снят).
//Структура: Разрешен, БезопасныйРежим, Текст.
Функция ДоступностьHTTP(ВБезопасномРежиме = Ложь) Экспорт

	Если ВБезопасномРежиме Тогда
		Возврат ДоступностьHTTPВБезопасномРежиме();
	КонецЕсли;
	Возврат ПроверитьHTTP();

КонецФункции

//HTTP-запрос к сервису другого вида (банк для оплаты по QR — УЗ_ПровайдерыОплатQR) через ту же единственную точку:
//песочница сеанса (только 127.0.0.1), таймаут, ключ не попадает в журнал и текст ошибки, безопасный режим — текстом.
//  Параметры — Структура: Адрес (базовый адрес сервиса), Ключ (скрывается в журнале и ошибках); необязательно —
//  СобытиеПесочницы, СобытиеОтправки, СобытиеОшибки (события журнала регистрации своего вида) и
//  ТекстБезопасногоРежима (что именно запрещено). Метод — "GET" или "POST"; Заголовки — Соответствие или
//  Неопределено; Тело — строка (UTF-8).
//Структура: Песочница, КодСостояния, Тело (строка), Ошибка (нет связи, таймаут, безопасный режим).
Функция ЗапросHTTP(Параметры, Метод, Путь, Заголовки, Тело, Описание) Экспорт
	Возврат ВыполнитьHTTP(Параметры, Метод, Путь, Заголовки, Тело, Описание);
КонецФункции

//Событие журнала регистрации: сообщение задержано песочницей (наружу не ушло).
Функция СобытиеПесочницы() Экспорт
	Возврат НСтр("ru = 'Учёт занятий.Сообщения.Песочница'");
КонецФункции

//Событие журнала регистрации: настоящая попытка отправки (пишется до подключения к сервису).
Функция СобытиеОтправки() Экспорт
	Возврат НСтр("ru = 'Учёт занятий.Сообщения.Отправка'");
КонецФункции

//Событие журнала регистрации: ошибки отправки и приёма сообщений.
Функция СобытиеОшибки() Экспорт
	Возврат НСтр("ru = 'Учёт занятий.Сообщения'");
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйИтог()
	Возврат Новый Структура("Отправлено, Песочница, СервисНедоступен, ТекстОшибки", Ложь, Ложь, Ложь, "");
КонецФункции

//Настройки канала с ключом — только для отправки; Неопределено — канал не настроен (Причина — почему).
Функция ПараметрыКанала(Канал, Причина)

	Параметры = Новый Структура("Канал, Провайдер, Адрес, Логин, Отправитель, Ключ", Канал);
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		Запись = РегистрыСведений.УЗ_НастройкиКаналов.СоздатьМенеджерЗаписи();
		Запись.Канал = Канал;
		Запись.Прочитать();
		Ключ = РегистрыСведений.УЗ_КлючиКаналов.СоздатьМенеджерЗаписи();
		Ключ.Канал = Канал;
		Ключ.Прочитать();
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		//безопасный режим: привилегированный режим не действует, а ролям ключи недоступны
		УстановитьПривилегированныйРежим(Ложь);
		Причина = НСтр("ru = 'Настройки канала недоступны:'") + " " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Неопределено;
	КонецПопытки;
	Если Не Запись.Выбран() Или Не Запись.Включен Тогда
		Причина = СтрШаблон(НСтр("ru = 'Канал «%1» выключен в настройках сообщений.'"), Канал);
		Возврат Неопределено;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Запись.Провайдер) Тогда
		Причина = СтрШаблон(НСтр("ru = 'У канала «%1» не выбран провайдер.'"), Канал);
		Возврат Неопределено;
	КонецЕсли;
	Если Не Ключ.Выбран() Или ПустаяСтрока(Ключ.Ключ) Тогда
		Причина = СтрШаблон(НСтр("ru = 'У канала «%1» не задан ключ доступа.'"), Канал);
		Возврат Неопределено;
	КонецЕсли;
	Если НуженЛогин(Запись.Провайдер) И ПустаяСтрока(Запись.Логин) Тогда
		Причина = СтрШаблон(НСтр("ru = 'У канала «%1» не указан логин (номер аккаунта) провайдера.'"), Канал);
		Возврат Неопределено;
	КонецЕсли;
	Параметры.Провайдер = Запись.Провайдер;
	Параметры.Адрес =
		?(ПустаяСтрока(Запись.АдресСервиса), АдресПоУмолчанию(Запись.Провайдер), СокрЛП(Запись.АдресСервиса));
	Параметры.Логин = СокрЛП(Запись.Логин);
	Параметры.Отправитель = СокрЛП(Запись.Отправитель);
	Параметры.Ключ = СокрЛП(Ключ.Ключ);
	Возврат Параметры;

КонецФункции

//Чат и имя отправителя обновления getUpdates; СТекстом — ещё и текст (у нажатия кнопки message — сообщение бота с
//кнопками, его текст не команда).
Процедура РазобратьСообщение(Запись, Сообщение, Отправитель, СТекстом)

	Если ТипЗнч(Отправитель) = Тип("Соответствие") Тогда
		Запись.Имя = ИмяОтправителя(Отправитель);
	КонецЕсли;
	Если ТипЗнч(Сообщение) <> Тип("Соответствие") Тогда
		Возврат;
	КонецЕсли;
	Чат = Сообщение.Получить("chat");
	Если ТипЗнч(Чат) = Тип("Соответствие") Тогда
		Запись.Чат = СтрокаЧисла(Чат.Получить("id"));
	КонецЕсли;
	Если СТекстом Тогда
		Запись.Текст = Строка(?(Сообщение.Получить("text") = Неопределено, "", Сообщение.Получить("text")));
	КонецЕсли;

КонецПроцедуры

//Telegram Bot API: POST /bot<токен>/sendMessage {chat_id, text}. 401 и 404 — неверный токен (сервис недоступен
//для всех), 400 и 403 — отказал получатель (нет чата, человек заблокировал бота), 429 и 5xx — сервис.
Процедура ОтправитьТелеграм(Параметры, Чат, Текст, Итог, Клавиатура = Неопределено)

	Тело = Новый Структура("chat_id, text", Чат, Текст);
	Если Клавиатура <> Неопределено Тогда
		Тело.Вставить("reply_markup", Клавиатура);
	КонецЕсли;
	Ответ = ВыполнитьHTTP(Параметры, "POST", "/bot" + Параметры.Ключ + "/sendMessage", ЗаголовкиJSON(),
		ЗаписатьВJSON(Тело),
		СтрШаблон(НСтр("ru = 'Telegram, чат %1'"), Чат));
	Данные = ПрочитатьОтвет(Ответ);
	Если РазобратьПесочницуИСвязь(Ответ, Итог) Тогда
		Возврат;
	КонецЕсли;
	Если Ответ.КодСостояния = 200 И Данные <> Неопределено И Данные.Получить("ok") = Истина Тогда
		Итог.Отправлено = Истина;
		Возврат;
	КонецЕсли;
	Итог.ТекстОшибки = "Telegram: " + ТекстОшибкиОтвета(Ответ, Данные, "description");
	Итог.СервисНедоступен = Не (Ответ.КодСостояния = 400 Или Ответ.КодСостояния = 403);

КонецПроцедуры

//SMS.ru: POST /sms/send (api_id, to, msg, json=1, from). Общий статус ERROR (неверный api_id, нет денег) —
//сервис недоступен; ошибка по номеру — отказал получатель.
Процедура ОтправитьSMSRU(Параметры, Телефон, Текст, Итог)

	Поля = Новый Массив;
	Поля.Добавить(ПолеФормы("api_id", Параметры.Ключ));
	Поля.Добавить(ПолеФормы("to", Телефон));
	Поля.Добавить(ПолеФормы("msg", Текст));
	Поля.Добавить(ПолеФормы("json", "1"));
	Если Не ПустаяСтрока(Параметры.Отправитель) Тогда
		Поля.Добавить(ПолеФормы("from", Параметры.Отправитель));
	КонецЕсли;
	Ответ = ВыполнитьHTTP(Параметры, "POST", "/sms/send", ЗаголовкиФормы(), СтрСоединить(Поля, "&"),
		СтрШаблон(НестрОтправкиSMS(), "SMS.ru", Телефон));
	Данные = ПрочитатьОтвет(Ответ);
	Если РазобратьПесочницуИСвязь(Ответ, Итог) Тогда
		Возврат;
	КонецЕсли;
	Если Данные = Неопределено Или Данные.Получить("status") <> "OK" Тогда
		Итог.ТекстОшибки = "SMS.ru: " + ТекстОшибкиОтвета(Ответ, Данные, "status_text");
		Итог.СервисНедоступен = Истина;
		Возврат;
	КонецЕсли;
	ПоНомерам = Данные.Получить("sms");
	ПоНомеру = ?(ТипЗнч(ПоНомерам) = Тип("Соответствие"), ПоНомерам.Получить(Телефон), Неопределено);
	Если ТипЗнч(ПоНомеру) = Тип("Соответствие") И ПоНомеру.Получить("status") <> "OK" Тогда
		Итог.ТекстОшибки = "SMS.ru: " + Строка(ПоНомеру.Получить("status_text"));
		Возврат;
	КонецЕсли;
	Итог.Отправлено = Истина;

КонецПроцедуры

//SMSC.ru: POST /sys/send.php (login, psw, phones, mes, fmt=3 — ответ JSON, charset=utf-8, sender). Ошибки 6, 7, 8
//(сообщение запрещено, неверный номер, не доставить) — отказал получатель; остальные (логин, деньги, блокировка
//IP, частые запросы) — сервис недоступен.
Процедура ОтправитьSMSC(Параметры, Телефон, Текст, Итог)

	Поля = Новый Массив;
	Поля.Добавить(ПолеФормы("login", Параметры.Логин));
	Поля.Добавить(ПолеФормы("psw", Параметры.Ключ));
	Поля.Добавить(ПолеФормы("phones", Телефон));
	Поля.Добавить(ПолеФормы("mes", Текст));
	Поля.Добавить(ПолеФормы("fmt", "3"));
	Поля.Добавить(ПолеФормы("charset", "utf-8"));
	Если Не ПустаяСтрока(Параметры.Отправитель) Тогда
		Поля.Добавить(ПолеФормы("sender", Параметры.Отправитель));
	КонецЕсли;
	Ответ = ВыполнитьHTTP(Параметры, "POST", "/sys/send.php", ЗаголовкиФормы(), СтрСоединить(Поля, "&"),
		СтрШаблон(НестрОтправкиSMS(), "SMSC.ru", Телефон));
	Данные = ПрочитатьОтвет(Ответ);
	Если РазобратьПесочницуИСвязь(Ответ, Итог) Тогда
		Возврат;
	КонецЕсли;
	Если Ответ.КодСостояния = 200 И Данные <> Неопределено И Данные.Получить("error") = Неопределено
		И Данные.Получить("id") <> Неопределено Тогда
		Итог.Отправлено = Истина;
		Возврат;
	КонецЕсли;
	Итог.ТекстОшибки = "SMSC.ru: " + ТекстОшибкиОтвета(Ответ, Данные, "error");
	КодОшибки = ?(Данные = Неопределено, 0, Данные.Получить("error_code"));
	Итог.СервисНедоступен = Не (КодОшибки = 6 Или КодОшибки = 7 Или КодОшибки = 8);

КонецПроцедуры

//Green-API: POST /waInstance<idInstance>/sendMessage/<apiTokenInstance> {chatId: "79001234567@c.us", message}.
//400 — неверный номер (получатель); 401, 403, 466 (лимит тарифа), 429, 5xx — сервис.
Процедура ОтправитьGreenAPI(Параметры, Телефон, Текст, Итог)

	Тело = Новый Структура("chatId, message", Телефон + "@c.us", Текст);
	Путь = СтрШаблон("/waInstance%1/sendMessage/%2", Параметры.Логин, Параметры.Ключ);
	Ответ = ВыполнитьHTTP(Параметры, "POST", Путь, ЗаголовкиJSON(), ЗаписатьВJSON(Тело),
		СтрШаблон(НСтр("ru = 'WhatsApp (Green-API), %1'"), Телефон));
	Данные = ПрочитатьОтвет(Ответ);
	Если РазобратьПесочницуИСвязь(Ответ, Итог) Тогда
		Возврат;
	КонецЕсли;
	Если Ответ.КодСостояния = 200 И Данные <> Неопределено И Данные.Получить("idMessage") <> Неопределено Тогда
		Итог.Отправлено = Истина;
		Возврат;
	КонецЕсли;
	Итог.ТекстОшибки = "Green-API: " + ТекстОшибкиОтвета(Ответ, Данные, "message");
	Итог.СервисНедоступен = Ответ.КодСостояния <> 400;

КонецПроцедуры

//Wazzup: POST /v3/message, заголовок Authorization: Bearer <ключ API>, {channelId, chatType: "whatsapp", chatId,
//text}. 400 — неверный номер или чат (получатель); 401, 403, 429, 5xx — сервис.
Процедура ОтправитьWazzup(Параметры, Телефон, Текст, Итог)

	Заголовки = ЗаголовкиJSON();
	Заголовки.Вставить("Authorization", "Bearer " + Параметры.Ключ);
	Тело = Новый Структура("channelId, chatType, chatId, text", Параметры.Логин, "whatsapp", Телефон, Текст);
	Ответ = ВыполнитьHTTP(Параметры, "POST", "/v3/message", Заголовки, ЗаписатьВJSON(Тело),
		СтрШаблон(НСтр("ru = 'WhatsApp (Wazzup), %1'"), Телефон));
	Данные = ПрочитатьОтвет(Ответ);
	Если РазобратьПесочницуИСвязь(Ответ, Итог) Тогда
		Возврат;
	КонецЕсли;
	Если Ответ.КодСостояния >= 200 И Ответ.КодСостояния < 300 Тогда
		Итог.Отправлено = Истина;
		Возврат;
	КонецЕсли;
	Итог.ТекстОшибки = "Wazzup: " + ТекстОшибкиОтвета(Ответ, Данные, "description");
	Итог.СервисНедоступен = Ответ.КодСостояния <> 400;

КонецПроцедуры

Функция НестрОтправкиSMS()
	Возврат НСтр("ru = 'SMS (%1), %2'");
КонецФункции

//Песочница (сообщение считается принятым) или нет связи с сервисом
//(сервис недоступен) — Истина: разбор ответа не нужен.
Функция РазобратьПесочницуИСвязь(Ответ, Итог)

	Если Ответ.Песочница Тогда
		Итог.Отправлено = Истина;
		Итог.Песочница = Истина;
		Возврат Истина;
	КонецЕсли;
	Если Не ПустаяСтрока(Ответ.Ошибка) Тогда
		Итог.ТекстОшибки = Ответ.Ошибка;
		Итог.СервисНедоступен = Истина;
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;

КонецФункции

//Единственная точка, где запрос уходит из базы наружу (аудит внешний_мир держит это правило).
//В песочнице сеанса запрос уходит только на эту машину (127.0.0.1, localhost — заглушка сервисов в тестах);
//к остальным адресам не подключаемся, а пишем событие «Учёт занятий.Сообщения.Песочница». Каждая настоящая
//попытка — событие «Учёт занятий.Сообщения.Отправка» ДО подключения: по журналу видно, что сообщения уходили
//(или не уходили — так проверяют тесты). Адрес в журнале — без пути и параметров: в них ключ доступа.
//Структура: Песочница, КодСостояния, Тело (строка), Ошибка (нет связи, таймаут, безопасный режим).
Функция ВыполнитьHTTP(Параметры, Метод, Путь, Заголовки, Тело, Описание)

	Итог = Новый Структура("Песочница, КодСостояния, Тело, Ошибка", Ложь, 0, "", "");
	Адрес = РазобратьАдрес(Параметры.Адрес);
	Если Адрес = Неопределено Тогда
		Итог.Ошибка = СтрШаблон(НСтр("ru = 'Неверный адрес сервиса «%1».'"), Параметры.Адрес);
		Возврат Итог;
	КонецЕсли;
	ОписаниеЖурнала = СтрШаблон("%1; %2 %3://%4", Описание, Метод, Адрес.Схема, Адрес.Хост);
	Если УЗ_Почта.ПесочницаВключена() И Не ЭтаМашина(Адрес.Хост) Тогда
		ЗаписьЖурналаРегистрации(СвойствоИли(Параметры, "СобытиеПесочницы", СобытиеПесочницы()),
			УровеньЖурналаРегистрации.Информация, , , ОписаниеЖурнала);
		Итог.Песочница = Истина;
		Возврат Итог;
	КонецЕсли;
	ЗаписьЖурналаРегистрации(СвойствоИли(Параметры, "СобытиеОтправки", СобытиеОтправки()),
		УровеньЖурналаРегистрации.Информация, , , ОписаниеЖурнала);

	Попытка
		Защищенное =
			?(Адрес.Схема = "https", Новый ЗащищенноеСоединениеOpenSSL(, Новый СертификатыУдостоверяющихЦентровОС),
			Неопределено);
		Соединение = Новый HTTPСоединение(Адрес.Хост, Адрес.Порт, , , , Таймаут(), Защищенное);
		Запрос = Новый HTTPЗапрос(Адрес.Путь + Путь);
		Если Заголовки <> Неопределено Тогда
			Для Каждого Заголовок Из Заголовки Цикл
				Запрос.Заголовки.Вставить(Заголовок.Ключ, Заголовок.Значение);
			КонецЦикла;
		КонецЕсли;
		Если Метод = "POST" Тогда
			Запрос.УстановитьТелоИзСтроки(Тело, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
			Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
		Иначе
			Ответ = Соединение.Получить(Запрос);
		КонецЕсли;
		Итог.КодСостояния = Ответ.КодСостояния;
		Итог.Тело = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	Исключение
		Итог.Ошибка = СкрытьКлюч(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), Параметры.Ключ);
		Если ЭтоБезопасныйРежим(Итог.Ошибка) Тогда
			Итог.Ошибка = СвойствоИли(Параметры, "ТекстБезопасногоРежима",
				НСтр("ru = 'Отправка сообщений в безопасном режиме запрещена.'")) + " "
					+ УЗ_Общий.КакСнятьБезопасныйРежим();
		КонецЕсли;
		ЗаписьЖурналаРегистрации(СвойствоИли(Параметры, "СобытиеОшибки", СобытиеОшибки()),
			УровеньЖурналаРегистрации.Ошибка, , , ОписаниеЖурнала + ": " + Итог.Ошибка);
	КонецПопытки;
	Итог.Тело = СкрытьКлюч(Итог.Тело, Параметры.Ключ);
	Возврат Итог;

КонецФункции

//Значение свойства структуры Параметры или ПоУмолчанию, если такого свойства нет.
Функция СвойствоИли(Параметры, Имя, ПоУмолчанию)

	Значение = Неопределено;
	Если Параметры.Свойство(Имя, Значение) И Значение <> Неопределено Тогда
		Возврат Значение;
	КонецЕсли;
	Возврат ПоУмолчанию;

КонецФункции

//Проба HTTP: подключение к закрытому порту этой машины — запрос никуда не уходит.
Функция ПроверитьHTTP()

	Результат = Новый Структура("Разрешен, БезопасныйРежим, Текст", Ложь, Ложь, "");
	Попытка
		Соединение = Новый HTTPСоединение("127.0.0.1", 1, , , , 2);
		Соединение.Получить(Новый HTTPЗапрос("/"));
		Результат.Разрешен = Истина;
	Исключение
		Результат.Текст = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат.БезопасныйРежим = ЭтоБезопасныйРежим(Результат.Текст);
		Результат.Разрешен = Не Результат.БезопасныйРежим;
	КонецПопытки;
	Возврат Результат;

КонецФункции

//Та же проба с включённым безопасным режимом: он действует до выхода из этой функции.
Функция ДоступностьHTTPВБезопасномРежиме()

	УстановитьБезопасныйРежим(Истина);
	Возврат ПроверитьHTTP();

КонецФункции

Функция ЭтоБезопасныйРежим(Текст)
	Возврат СтрНайти(НРег(Текст), "безопасн") > 0 Или СтрНайти(НРег(Текст), "safe mode") > 0;
КонецФункции

Функция ЭтаМашина(Хост)
	Возврат Хост = "127.0.0.1" Или НРег(Хост) = "localhost" Или Хост = "[::1]";
КонецФункции

//Адрес сервиса «https://api.telegram.org» или «http://127.0.0.1:8765/tg» → Структура Схема, Хост, Порт, Путь
//(без «/» на конце); Неопределено — адрес не разобрать.
Функция РазобратьАдрес(Знач Строка)

	Строка = СокрЛП(Строка);
	Схема = "https";
	Поз = СтрНайти(Строка, "://");
	Если Поз > 0 Тогда
		Схема = НРег(Лев(Строка, Поз - 1));
		Строка = Сред(Строка, Поз + 3);
	КонецЕсли;
	Если Схема <> "http" И Схема <> "https" Тогда
		Возврат Неопределено;
	КонецЕсли;
	Поз = СтрНайти(Строка, "/");
	Путь = "";
	Если Поз > 0 Тогда
		Путь = Сред(Строка, Поз);
		Строка = Лев(Строка, Поз - 1);
	КонецЕсли;
	Пока СтрЗаканчиваетсяНа(Путь, "/") Цикл
		Путь = Лев(Путь, СтрДлина(Путь) - 1);
	КонецЦикла;
	Порт = ?(Схема = "https", 443, 80);
	Поз = СтрНайти(Строка, ":");
	Если Поз > 0 Тогда
		ТекстПорта = Сред(Строка, Поз + 1);
		Строка = Лев(Строка, Поз - 1);
		Если ПустаяСтрока(ТекстПорта) Или Не ТолькоЦифры(ТекстПорта) Тогда
			Возврат Неопределено;
		КонецЕсли;
		Порт = Число(ТекстПорта);
	КонецЕсли;
	Если ПустаяСтрока(Строка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Новый Структура("Схема, Хост, Порт, Путь", Схема, Строка, Порт, Путь);

КонецФункции

Функция ТолькоЦифры(Текст)

	Для Поз = 1 По СтрДлина(Текст) Цикл
		Если СтрНайти("0123456789", Сред(Текст, Поз, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;

КонецФункции

//Таймаут одного запроса, секунд: сервис недоступен — цикл отправки ждёт его один раз, остальным не шлёт.
Функция Таймаут()
	Возврат 15;
КонецФункции

Функция ЗаголовкиJSON()

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Заголовки.Вставить("Accept", "application/json");
	Возврат Заголовки;

КонецФункции

Функция ЗаголовкиФормы()

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=utf-8");
	Заголовки.Вставить("Accept", "application/json");
	Возврат Заголовки;

КонецФункции

Функция ПолеФормы(Имя, Значение)
	Возврат Имя + "=" + КодироватьСтроку(Значение, СпособКодированияСтроки.КодировкаURL);
КонецФункции

Функция ЗаписатьВJSON(Данные)

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Данные);
	Возврат Запись.Закрыть();

КонецФункции

//Тело ответа ЗапросHTTP как Соответствие (JSON) или Неопределено — не JSON (и для банков оплаты по QR).
Функция ПрочитатьОтвет(Ответ) Экспорт

	Если Ответ.Песочница Или ПустаяСтрока(Ответ.Тело) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Попытка
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Ответ.Тело);
		Данные = ПрочитатьJSON(Чтение, Истина);
		Чтение.Закрыть();
	Исключение
		//честно: ответ не JSON (страница ошибки прокси, HTML) — причина будет по коду состояния, см. ТекстОшибкиОтвета
		Возврат Неопределено;
	КонецПопытки;
	Возврат ?(ТипЗнч(Данные) = Тип("Соответствие"), Данные, Неопределено);

КонецФункции

//Причина отказа для журнала: поле ответа провайдера (описание ошибки) или код состояния HTTP.
Функция ТекстОшибкиОтвета(Ответ, Данные, ПолеОписания)

	Если Не ПустаяСтрока(Ответ.Ошибка) Тогда
		Возврат Ответ.Ошибка;
	КонецЕсли;
	Описание = ?(Данные = Неопределено, Неопределено, Данные.Получить(ПолеОписания));
	Если Описание <> Неопределено Тогда
		Возврат СтрШаблон(НСтр("ru = '%1 (код ответа %2)'"), Строка(Описание),
			Формат(Ответ.КодСостояния, "ЧГ=0; ЧН=0"));
	КонецЕсли;
	Возврат СтрШаблон(НСтр("ru = 'сервис ответил кодом %1'"), Формат(Ответ.КодСостояния, "ЧГ=0; ЧН=0"))
		+ ?(ПустаяСтрока(Ответ.Тело), "", ": " + Лев(Ответ.Тело, 200));

КонецФункции

Функция СкрытьКлюч(Текст, Ключ)

	Если ПустаяСтрока(Ключ) Или СтрДлина(Ключ) < 4 Тогда
		Возврат Текст;
	КонецЕсли;
	Возврат СтрЗаменить(Текст, Ключ, "***");

КонецФункции

//Число из JSON (номер чата Telegram бывает длиннее 10 знаков и отрицательным) — строкой без разделителей.
Функция СтрокаЧисла(Значение)

	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Формат(Значение, "ЧГ=0; ЧН=0");
	КонецЕсли;
	Возврат ?(Значение = Неопределено, "", Строка(Значение));

КонецФункции

Функция ИмяОтправителя(Отправитель)

	Имя = СокрЛП(Строка(?(Отправитель.Получить("first_name") = Неопределено, "", Отправитель.Получить("first_name")))
		+ " " + Строка(?(Отправитель.Получить("last_name") = Неопределено, "", Отправитель.Получить("last_name"))));
	Логин = Отправитель.Получить("username");
	Если Логин <> Неопределено Тогда
		Имя = СокрЛП(Имя + " @" + Строка(Логин));
	КонецЕсли;
	Возврат Лев(Имя, 100);

КонецФункции

#КонецОбласти
